In [21]:
# ライブラリのインポート
import pandas as pd

# 辞書からデータフレーム作成1
dict1 = dict(COL1 = ['01', '02', '03', '04'], COL2 = ['武田', '北条', '今川', '上杉'], COL3 = ['D1', 'D2', 'D2', 'D3'])
frame1 = pd.DataFrame(data=dict1)

# 辞書からデータフレーム作成2
dict2 = dict(COL3 = ['D1', 'D2', 'D3', 'D4', 'D5'], COL4 = ['管理部', '開発部', '営業部', '資材部', '総務部'])
frame2 = pd.DataFrame(data=dict2)

In [22]:
# データフレーム1表示
frame1

  COL1 COL2 COL3
0   01   武田   D1
1   02   北条   D2
2   03   今川   D2
3   04   上杉   D3

In [23]:
# データフレーム2表示
frame2

  COL3 COL4
0   D1  管理部
1   D2  開発部
2   D3  営業部
3   D4  資材部
4   D5  総務部

In [24]:
# 左外部結合
main = pd.merge(frame1, frame2, how='left', on='COL3')

In [25]:
# 結合済みのデータフレーム表示
main

  COL1 COL2 COL3 COL4
0   01   武田   D1  管理部
1   02   北条   D2  開発部
2   03   今川   D2  開発部
3   04   上杉   D3  営業部